app/Controllers/CategoriaController.php

INSERT INTO `categorias` (`nombre`, `descripcion`, `status`, `created_at`, `updated_at`) VALUES ('Audio', 'djlañsdlasdlñkasñdklñ', NULL, '2023-12-02 17:29:49', '2023-12-02 17:29:49')
---
    public function store()
    {
        $data = [
            'nombre'        => $this->request->getPost('nombre'),
            'descripcion'   => $this->request->getPost('descripcion'),
            'status'        => $this->request->getPost('status  ')
        ];

        $this->categoriaModel->insert($data);